const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21',()=> {
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ 7
test('2 + 5 เท่ากับ 7', ()=>{
  expect(sum(2,5)).toBe(7)
});

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy
// 13 + 2 เท่ากับ 15
test('13 + 2 เท่ากับ 15',()=>{
  expect(sum(13,2)).toBe(15)
});

// 100 + 10 เท่ากับ 110
test('100 + 10 เท่ากับ 110',()=>{
  expect(sum(100,10)).toBe(110)
});

// 16 + 8 เท่ากับ 24
test('16 + 8 เท่ากับ 24',()=>{
  expect(sum(16,8)).toBe(24)
});